export const tableCategories: Record<string, string[]> = {
    area: ['name'],
    building: ['name', 'isStaff'],
    floor: ['floorNumber', 'type'],
    room: ['name', 'branchName', 'type', 'gender', 'maxCapacity', 'disabled', 'networks'],
};

export const tableExampleData: Record<string, string[][]> = {
    area: [['שם האזור'], ['אזור חדש']],
    building: [
        ['בניין ספיר', 'כן'],
        ['בניין המערך', 'לא'],
    ],
    floor: [
        ['1', 'טר"צ'],
        ['2', 'יסוד'],
    ],
    room: [
        ['חדר 12', 'יסודות', 'חדר שינה', 'זכר', '8', 'כן', ''],
        ['חדר 321', 'סייבר', 'כיתה', '', '5', 'לא', ''],
        ['חדר 219', 'מוד"ש', 'משרד', '', '21', 'לא', ''],
        ['משרד 452', 'מוד"ש', 'משרד', '', '12', 'לא', 'עד המטר: 3, אינטרנט: 5'],
        ['משרד 361', 'סייבר', 'משרד', '', '8', 'לא', 'נס קפה: 5, רמלה: 2'],
        ['מחסן 2', 'סגן', 'משרד', '', '15', 'לא', ''],
        ['כיתת תאנה', 'תקשוב', 'כיתה', '', '40', 'כן', 'עד המטר: 3, אינטרנט: 5'],
        ['כיתת ארזים א', 'תקשוב', 'כיתה', '', '32', 'לא', 'נס קפה: 5, רמלה: 2'],
        ['אולם ספורט', 'סגן', 'משרד', '', '50', 'לא', ''],
    ],
};
